Revit 2027 API
Railing.SetMultistoryStairsPlacementLevels Method
 Sets the ids of the base levels of the stairs upon which this railing is placed.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMultistoryStairsPlacementLevels(
	ISet<ElementId> levelIds
)
Public Sub SetMultistoryStairsPlacementLevels (
	levelIds As ISet(Of ElementId)
)
public:
void SetMultistoryStairsPlacementLevels(
	ISet<ElementId^>^ levelIds
)
member SetMultistoryStairsPlacementLevels :
        levelIds : ISet<ElementId> -> unit
Parameters
levelIds ISet<ElementId>
 The ids of levels the railing is placed on. If input level id set is empty, railings will placed on all levels of the hosting stairs.
Exceptions
Exception | Condition
ArgumentException |  All of the level ids in levelIds must be placement levels of stairs.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The railing is not hosted by stairs in MultistoryStairs.
Remarks
 The method is valid only for railings hosted by stairs in MultistoryStairs. The input level ids have to be a subset of level ids of the railing stairs. See MultistoryStairs for information about the placement levels that may be passed as input.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace